dates = [
    (882, "Угорська руська об'єдналася з Київською"),
    (988, "Хрещення Русі-України"),
    (1240, "Монгольська навала на Київ"),
    (1654, "Бігмейдан"),
    (1709, "Полтавська битва"),
    (1768, "Коліївщина"),
    (1848, "Угода під Кременцем"),
    (1917, "Утворення Української Народної Республіки"),
    (1918, "Проголошення незалежності УНР"),
    (1920, "Польсько-Українська війна"),
    (1932, "Голодомор"),
    (1941, "Німецька окупація України"),
    (1945, "Завершення Другої світової війни"),
    (1954, "Передача Криму від РСФР до УРСР"),
    (1991, "Проголошення незалежності України"),
    (2004, "Помаранчева революція"),
    (2014, "Революція гідності"),
    (2014, "Анексія Криму Росією"),
    (2019, "Обрання Володимира Зеленського Президентом України")
]

time_check = {year: event for year, event in dates}

go_to = {882, 2023, 1954, 2005, 2006, 2004, 1932, 1920, 1848}

for year in go_to:
    try:
        event = time_check[year]
        print(f"В {year} році відбулось: {event}")
    except KeyError:
        print(f"Не знайдено подій у {year} році.")